Revit 2015 API
Selection Properties
The Selection type exposes the following members.
Properties
Name | Description
Elements |  Obsolete.
The elements that are shown as selected in the Revit user-interface.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
Selection Class
Autodesk.Revit.UI.Selection Namespace